In [1]:
import pandas as pd

In [4]:
list = [1,2,3,4,5,'ayush',33,'honey','pw',True]
pd.Series(list)

0        1
1        2
2        3
3        4
4        5
5    ayush
6       33
7    honey
8       pw
9     True
dtype: object

In [13]:
dict = {'Name': ("Alice",'Bob','Claire'), 'Age':[25,30,27], 'Gender':['Female','Male','Female']}

In [18]:
df = pd.DataFrame(dict)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [19]:
# question 4
# DataFrame-> It is a 2d data structure which can hold data of any type in a tabular form.
# series -> Series is a 1-D array labeled that can hold data of one type
# Difference between DataFrame and Series - > dataframe is a ind of 2d array and have multiple columns where as series have only one
# column of data. We can also say that collection of series(columns) is DataFrame.

In [22]:
# Example - In questio 3 we created a data frame using dictionary which is a 2d array 
#  and each column in that dataframe is series. we can see that by 
df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [23]:
# Question 5
# Some common function used in pandas are
# head() -> show 1st 5 rows of tabel
# tail()-> Shows last 5 rows of a tabel
# describe() -> generates the stastics summary of a dataframe
# sort_values() -> sort values of column in the given order

In [55]:
# example
sample = {'Name':['Ayush','Amit','Shubam','Kuldeep','shreya'],'Age':[20,23,24,25,26],'Gender':['M','M','M','M','F']}
df2 = pd.DataFrame(sample)
df2.head(2)

    Name  Age Gender
0  Ayush   20      M
1   Amit   23      M

In [33]:
df2.tail(2)

      Name  Age Gender
2   Shubam   24      M
3  Kuldeep   25      M

In [47]:
df2.describe()

             Age
count   5.000000
mean   18.400000
std    10.454664
min     0.000000
25%    20.000000
50%    23.000000
75%    24.000000
max    25.000000

In [46]:
df2.sort_values('Age', ascending = False) 
# sorting in descending order

      Name  Age Gender
3  Kuldeep   25      M
2   Shubam   24      M
1     Amit   23      M
0    Ayush   20      M
4   shreya    0      F

In [ ]:
# Question 6
# In pandas DataFrame and Series both ar mutable i.e values can be changed but size can not be aleterd

In [62]:
# Question 7 
name = pd.Series(['Ayush','Amit','Shubam','Kuldeep','shreya'])
age  = pd.Series([20,23,24,25,27])
data = {'Name':name,'Age':age}
df3  = pd.DataFrame(data)
df3

      Name  Age
0    Ayush   20
1     Amit   23
2   Shubam   24
3  Kuldeep   25
4   shreya   27